Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyNoParents Property
 Can't Copy to Clipboard because of relationships between Elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyNoParents { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyNoParents As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyNoParents {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace